GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/STM32MCP/STM32MCP.h
/*********************************************************************
 * FUNCTIONS
 */
/*==========Mandatory Function has to be added=========*/
extern void STM32MCP_init();
extern void STM32MCP_registerCBs(STM32MCP_CBs_t *STM32MCP_CBs);//Use it in the main function
extern void STM32MCP_registerHeartbeat(STM32MCP_timerManager_t *object);
extern void STM32MCP_registerTimer(STM32MCP_timerManager_t *STM32MCP_timerManager);//Added to peripherals already, just use UDHAL_init()
extern void STM32MCP_registerUart(STM32MCP_uartManager_t *STM32MCP_uartManager);//Added to peripherals already, just use UDHAL_init()
/*==========Mandatory Function has to be added=========*/
extern void STM32MCP_startCommunication();
extern void STM32MCP_closeCommunication();
extern void STM32MCP_toggleCommunication();
/*==============================================================*/
extern STM32MCP_regAttribute_t *STM32MCP_findRegister(uint8_t motorID, uint8_t regID);
/*=========================================================API functions=============================================================*/
extern void STM32MCP_setRegisterFrame(uint8_t motorID, uint8_t regID, uint8_t payloadLength, uint8_t *payload);
extern void STM32MCP_getRegisterFrame(uint8_t motorID, uint8_t regID);
extern void STM32MCP_executeCommandFrame(uint8_t motorID, uint8_t commandID);
extern void STM32MCP_getBoardInfo();
extern void STM32MCP_executeRampFrame(uint8_t motorID, int32_t finalSpeed, uint16_t duration);
extern void STM32MCP_getRevupDataFrame(uint8_t motorID, uint8_t stage);
extern void STM32MCP_setRevupDataFrame(uint8_t motorID, uint8_t stage, int32_t finalSpeed, int16_t finalTorque, uint16_t duration);
extern void STM32MCP_setCurrentReferencesFrame(uint8_t motorID, int16_t torqueReference, int16_t fluxReference);
extern void STM32MCP_setSystemControlConfigFrame(uint8_t sysCmdId);
/*==========================================================E-SCOOTER Control Functions ==============================================================*/
extern void STM32MCP_setSpeedModeConfiguration(int32_t torqueIQ, int32_t allowableSpeed, uint16_t rampRate);
extern void STM32MCP_setDynamicCurrent(int32_t allowableSpeed, int32_t IQValue);
/*=================================================Functions to set the internal registers============================================*/
extern void STM32MCP_setRegisterAttribute(uint8_t motorID, uint8_t regID, uint8_t payloadLength, uint8_t *payload);
extern STM32MCP_regAttribute_t *STM32MCP_getRegisterAttribute(uint8_t motorID, uint8_t regID);
extern void STM32MCP_setBoardInfo(uint8_t *msg, uint8_t size);
/*====================================================================================================================================*/
/*===============================================Functions to be added to callback functions==========================================*/
extern void STM32MCP_flowControlHandler(uint8_t receivedByte);//Add to UART Rx ISR or UART RX callback
extern void STM32MCP_retransmission();
/*********************************************************************
*********************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* STM32MCP_STM32MCP_H_ */
